#language: ru

Функционал: ЯндексМаркет

  Сценарий: Поиск телевизоров LG и Samsung в ЯндексМаркете

    Когда Осуществлен переход на страницу Яндекса
    Когда Выбран пунк меню "Маркет"
    Когда Выбран пунк меню - Электроника
    Когда Выбран пунк меню - Телевизоры
    Когда заполняются поля:
    |Сумма|20000|
    Когда Выбран чек бокс Samsung
    Когда Выбран чек бокс LG
    Когда Выполнено нажатие на кнопку Применить
    Когда Выполнена проверка Элиментов на форме телевизоров = 12
    Когда Запомнили значение 1ого элимента Телевизора и делаем поиск по нему

  Сценарий: Поиск наушников в ЯндексМаркете

    Когда Осуществлен переход на страницу Яндекса
    Когда Выбран пунк меню "Маркет"
    Когда Выбран пунк меню - Электроника
    Когда Выбран пунк меню - Наушники
    Когда заполняются поля:
      |Сумма|5000|
    Когда Выбран чек бокс Beats
    Когда Выполнено нажатие на кнопку Применить
    Когда Выполнена проверка Элиментов на форме наушников = 12
    Когда Запомнили значение 1ого элимента Наушников и делаем поиск по нему









